node {
  name: "global_step/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/IsVariableInitialized"
  op: "IsVariableInitialized"
  input: "global_step"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "global_step/cond/Switch"
  op: "Switch"
  input: "global_step/IsVariableInitialized"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_t"
  op: "Identity"
  input: "global_step/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_f"
  op: "Identity"
  input: "global_step/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/pred_id"
  op: "Identity"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read"
  op: "Identity"
  input: "global_step/cond/read/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read/Switch"
  op: "RefSwitch"
  input: "global_step"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Switch_1"
  op: "Switch"
  input: "global_step/Initializer/zeros"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Merge"
  op: "Merge"
  input: "global_step/cond/Switch_1"
  input: "global_step/cond/read"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/add/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step/add"
  op: "Add"
  input: "global_step/cond/Merge"
  input: "global_step/add/y"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "tensors/component_0"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 73
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 73
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\311b-Z\306\177\346?nf\351b\363\275\347?\311b-Z\306\177\346?L\266\224\317-\205\351?4\001e\030\331\226\347?@3P\004\024H\347?\361\"k(\213\370\346?\361\"k(\213\370\346?\2430\030Lh \347?\2430\030Lh \347?\323\346\357\240\036W\346?\3579\372\376B.\346?\311\302!\356\n;\351?Up\004\313\216o\347?\361\"k(\213\370\346?\361\"k(\213\370\346?\3579\372\376B.\346?Up\004\313\216o\347?\2430\030Lh \347?\2174\023\331\302\210\345?\260\023\326\270&2\350?\361\"k(\213\370\346?4\001e\030\331\226\347?k2<\010\260\007\344?\003)\236:\377\251\351?/\317\215\035|\320\346?\003)\236:\377\251\351?Up\004\313\216o\347?\257-\235y\246\316\351?\\uvfs\262\345?\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "tensors/component_1"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 73
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 73
          }
        }
        tensor_content: "\2174\023\331\302\210\325?\351\005\335%\270\343\301?\304r\343\2679p\303?\0313\000\304z\250\303?\203A\023U]\214\303?\350\215\325k\360T\301?\023\216\315\356C\342\300?\344\004\326\004\247\033\301?T;\020\363\376\213\300?\007M#\261\370\376\300?^\325ZL\341q\302?\304r\343\2679p\303?\257\247\351!\243\340\303?\351\005\335%\270\343\301?\250\312!\005=\216\302?\317/\352v\222\252\302?^\325ZL\341q\302?\304r\343\2679p\303?\211\243\314I\177U\302?\022\020\204k3\000\302?\030\200\270\351\017T\303?\304r\343\2679p\303?[\256\254\372\0269\302?\350\215\325k\360T\301?\007S>\347\262\030\304?\257\247\351!\243\340\303?\263\016\007>m\377\302?\007S>\347\262\030\304?k=\277: \216\301?\007S>\347\262\030\304?\263\016\007>m\377\302?L\005\004\350\361B\326?|\226\314\322\230\024\326?\r-U\276\236e\326?\006eL\265\270\373\324?m\353\250\024\036\346\325?\025\217\354\204)q\326?\351\270\241\360\202N\326?\204@\346\253_\375\325?*o|\342\021Z\326?\225\006\365+S\035\327?\2174\023\331\302\210\325?\250\346\341\307^7\326?\215\3130Z#\344\326?&\025FA\300\252\326?\025\217\354\204)q\326?Z\216\376\034z\332\325?\023\222\264\356\277\361\325?\250\346\341\307^7\326?{\244\374h\235e\325?\377\t%\355o\314\324?6\362\344h\276\264\324?Z\216\376\034z\332\325?\025\217\354\204)q\326?\2174\023\331\302\210\325?v\226\344\021PV\327?4\307\225\330\r}\325?\204@\346\253_\375\325?\025\217\354\204)q\326?\250\346\341\307^7\326?v\226\344\021PV\327?Jf\264\006\325\253\325?)Q\360\006\324\316\325?\204@\346\253_\375\325?p\236\270\321+\303\325?4\307\225\330\r}\325?B\206y\217\311+\326?B\206y\217\311+\326?\255\311\0027\262|\326?\027\244\010>2 \326?\027\244\010>2 \326?\247\243\255n&\314\332?\247\243\255n&\314\332?"
      }
    }
  }
}
node {
  name: "tensors/component_2"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 73
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 73
          }
        }
        tensor_content: "\002 *\372\013\253\374?\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\344\347\361\275{V\005@\326\0036\036\207|\005@\344\347\361\275{V\005@\3445\255\323\264k\005@\326\0036\036\207|\005@q\355Z\270\354o\005@\027Q\033\200\021f\005@\326\0036\036\207|\005@\326\0036\036\207|\005@\367\240|^XE\005@\247\200%\\\311P\005@\344\347\361\275{V\005@\344\347\361\275{V\005@\323\276\236\274\377^\005@\247\200%\\\311P\005@AJ`\326\270<\005@\247\200%\\\311P\005@b\033\201\010\225]\005@\351bg\264zg\005@:\n\311d\"t\005@:\n\311d\"t\005@\017\204\2130j`\005@\3445\255\323\264k\005@>\001\273\211\"\237\005@q\356\031^Lj\005@\207n\373&6H\005@\207n\373&6H\005@\304\035\n\251\343h\005@x\004\307\332\273y\005@%\331\033\024*\\\005@\375J\270\233!{\005@\243o\017\014\250d\005@\304\035\n\251\343h\005@\027Q\033\200\021f\005@\367\240|^XE\005@\317o`R\315X\375?\317o`R\315X\375?\317o`R\315X\375?\201\3114\231Z1\375?\201\3114\231Z1\375?\377!\204j\266~\350?\377!\204j\266~\350?"
      }
    }
  }
}
node {
  name: "tensors/component_3"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 73
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 73
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\004\271\214\021\331\337\344?\260\220\033\313\231\257\343?\260\220\033\313\231\257\343?\260\220\033\313\231\257\343?\013\216\215\336`3\344?\341\324\212\0263\203\343?\013\216\215\336`3\344?\013\216\215\336`3\344?\341\324\212\0263\203\343?$\335\270\333\021\265\344?d\312\237cg\n\345?\013\216\215\336`3\344?\260\220\033\313\231\257\343?$\335\270\333\021\265\344?\024\251P\264\333^\345?\024\251P\264\333^\345?[x=)\021\212\344?C\036\310^\326^\344?C\036\310^\326^\344?C\036\310^\326^\344?C\036\310^\326^\344?\277D\3568\303\333\343?$\335\270\333\021\265\344?\2174\023\331\302\210\345?[x=)\021\212\344?$\335\270\333\021\265\344?C\036\310^\326^\344?\003\361yh\2754\345?C\036\310^\326^\344?\004\271\214\021\331\337\344?\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "tensors/component_4"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 73
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 73
          }
        }
        tensor_content: "\2174\023\331\302\210\325?\013\214bg\207\223\355?ed\271\262\227/\357?\033\265#\325/m\357?W\324e\362R\322\356?\367*\2457\373s\356?\203\327\324\322\000\347\357?\332\327\311$z4\356?\203\327\324\322\000\347\357?\025\313\375{\230 \360?W\324e\362R\322\356?e\350\232\362\236\020\357?\352\2758\361\267\310\357?\316&\'\032\212\024\356?\244\022\307\225rN\357?Z\243d\033\210\361\356?Z\243d\033\210\361\356?\033\265#\325/m\357?e\350\232\362\236\020\357?W\324e\362R\322\356?\367*\2457\373s\356?ed\271\262\227/\357?\267ut\017z\364\355?\367*\2457\373s\356?T\003Q\304I\324\355?\244\022\307\225rN\357?\014\265\023KR\252\357?\234T\212\251\317\213\357?|\036\024\223\226\002\360?\234T\212\251\317\213\357?ed\271\262\227/\357?1So\355\021\340\336?\317&\'\032\212\024\336?\204\267\001\354\236z\336?1So\355\021\340\336?\030\005\324\204\273u\334?l4KFl\336\334?&\240pp\321\255\335?&\240pp\321\255\335?\2679\232\335rF\335?\030\005\324\204\273u\334?l4KFl\336\334?l4KFl\336\334?l4KFl\336\334?BFb\267R\242\333?&\240pp\321\255\335?&\240pp\321\255\335?&\240pp\321\255\335?l4KFl\336\334?l4KFl\336\334?BFb\267R\242\333?BFb\267R\242\333?\317&\'\032\212\024\336?l4KFl\336\334?\2679\232\335rF\335?l4KFl\336\334?\204\267\001\354\236z\336?&\240pp\321\255\335?\317&\'\032\212\024\336?&\240pp\321\255\335?&\240pp\321\255\335?\323\370\010m\032\251\337?\317&\'\032\212\024\336?\2679\232\335rF\335?\317&\'\032\212\024\336?\"\232\232\307\367\217\314?\316_\033\006P\023\325?\316_\033\006P\023\325?\204@\346\253_\375\325?\025\217\354\204)q\326?\025\217\354\204)q\326?b\027R\377\271\244\350?b\027R\377\271\244\350?"
      }
    }
  }
}
node {
  name: "tensors/component_5"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 73
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 73
          }
        }
        tensor_content: "\3579\372\376B.\346?\366\007}\344\3514\323?qH\241\241\021\225\315?qH\241\241\021\225\315?qH\241\241\021\225\315?h\3429\n\305\210\313?\"\232\232\307\367\217\314?h\3429\n\305\210\313?h\3429\n\305\210\313?\"\232\232\307\367\217\314?\223%[\025\033\230\316?z\263\263l\034\231\317?\3174\327\346\037H\321?qH\241\241\021\225\315?\223%[\025\033\230\316?z\263\263l\034\231\317?z\263\263l\034\231\317?\334\271\341{\223\312\320?\223%[\025\033\230\316?\"\232\232\307\367\217\314?\223%[\025\033\230\316?\"\232\232\307\367\217\314?h\3429\n\305\210\313?\223%[\025\033\230\316?z\263\263l\034\231\317?\334\271\341{\223\312\320?\223%[\025\033\230\316?\334\271\341{\223\312\320?z\263\263l\034\231\317?\334\271\341{\223\312\320?\223%[\025\033\230\316?\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000 \\\376\237\242\341\353? \\\376\237\242\341\353? \\\376\237\242\341\353?\2244t\320^W\353?\2244t\320^W\353?1So\355\021\340\336?1So\355\021\340\336?"
      }
    }
  }
}
node {
  name: "tensors/component_6"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 73
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 73
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\'\261-wa\235\366?\250(&\177~i\367?\250(&\177~i\367?\250(&\177~i\367?\216\220)\217\220\t\367?\344\253y\246C\261\366?\216\220)\217\220\t\367?\216\220)\217\220\t\367?\344\253y\246C\261\366?\344\253y\246C\261\366?\"U\377\344\350\316\366?\376\3323|\276\330\366?\"U\377\344\350\316\366?/\320\3610\033\366\366?p\256\262\023g\223\366?p\256\262\023g\223\366?\376\3323|\276\330\366?\376\3323|\276\330\366?\324HUsf\211\366?\376\3323|\276\330\366?\324HUsf\211\366?\'\261-wa\235\366?\222\235\257\013\216\342\366?\303\030Q\325\330\377\366?\376\3323|\276\330\366?/\320\3610\033\366\366?\'\261-wa\235\366?\216\220)\217\220\t\367?\'\261-wa\235\366?p\256\262\023g\223\366?h\3429\n\305\210\313?\177:\250\267p\177\312?h\3429\n\305\210\313?\"\232\232\307\367\217\314?\177:\250\267p\177\312?\177:\250\267p\177\312?\"\232\232\307\367\217\314?\177:\250\267p\177\312?\177:\250\267p\177\312?\250\306\213\347\361s\311?h\3429\n\305\210\313?\250\306\213\347\361s\311?\250\306\213\347\361s\311?qH\241\241\021\225\315?h\3429\n\305\210\313?qH\241\241\021\225\315?h\3429\n\305\210\313?\250\306\213\347\361s\311?qH\241\241\021\225\315?h\3429\n\305\210\313?h\3429\n\305\210\313?\"\232\232\307\367\217\314?\177:\250\267p\177\312?qH\241\241\021\225\315?\250\306\213\347\361s\311?\177:\250\267p\177\312?\177:\250\267p\177\312?\250\306\213\347\361s\311?qH\241\241\021\225\315?\"\232\232\307\367\217\314?\177:\250\267p\177\312?\"\232\232\307\367\217\314?\250\306\213\347\361s\311?h\3429\n\305\210\313?\007S>\347\262\030\304?\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000|\036\024\223\226\002\360?|\036\024\223\226\002\360?"
      }
    }
  }
}
node {
  name: "tensors/component_7"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 73
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 73
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000]\243\362\275\353}\216?\331\362\010\256\001n\210?\331\362\010\256\001n\210?\331\362\010\256\001n\210?]\243\362\275\353}\216?arz#\250\200x?]\243\362\275\353}\216?]\243\362\275\353}\216?arz#\250\200x?\304,\341\rv\222|?\304,\341\rv\222|?arz#\250\200x?\341\220z\345\255g\206?6d^!|Y\202?\363\344j\240\235Q\200?\363\344j\240\235Q\200?\225b)X y\214?\372q\326\372\320mt?|6\312\314\326`\204?\372q\326\372\320mt?|6\312\314\326`\204?\331\362\010\256\001n\210?\374\367\302\014\360Yp?\331\362\010\256\001n\210?\225b)X y\214?6d^!|Y\202?arz#\250\200x?\304,\341\rv\222|?arz#\250\200x?\374\367\302\014\360Yp?\341\220z\345\255g\206?\331\362\010\256\001n\210?\341\220z\345\255g\206?6d^!|Y\202?\331\362\010\256\001n\210?6d^!|Y\202?\331\362\010\256\001n\210?\331\362\010\256\001n\210?\331\362\010\256\001n\210?|6\312\314\326`\204?\331\362\010\256\001n\210?\341\220z\345\255g\206?\341\220z\345\255g\206?\331\362\010\256\001n\210?\331\362\010\256\001n\210?\331\362\010\256\001n\210?\331\362\010\256\001n\210?\363\344j\240\235Q\200?|6\312\314\326`\204?\341\220z\345\255g\206?\341\220z\345\255g\206?\225b)X y\214?|6\312\314\326`\204?\341\220z\345\255g\206?\341\220z\345\255g\206?\341\220z\345\255g\206?\341\220z\345\255g\206?|6\312\314\326`\204?~U\334h\322s\212?~U\334h\322s\212?~U\334h\322s\212?]\243\362\275\353}\216?|6\312\314\326`\204?\331\362\010\256\001n\210?\341\220z\345\255g\206?\212[\004n\032A\220?\212[\004n\032A\220?\212[\004n\032A\220?\225b)X y\214?\225b)X y\214?\363\344j\240\235Q\200?\363\344j\240\235Q\200?"
      }
    }
  }
}
node {
  name: "tensors/component_8"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 73
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 73
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\326\251L\243\t\212h?\326\251L\243\t\212h?\326\251L\243\t\212h?\326\251L\243\t\212h?I\367\375\202\035^`?\326\251L\243\t\212h?I\367\375\202\035^`?I\367\375\202\035^`?\326\251L\243\t\212h?I\367\375\202\035^`?I\367\375\202\035^`?\304<\214O5`P?\326\251L\243\t\212h?I\367\375\202\035^`?\304<\214O5`P?\304<\214O5`P?\304<\214O5`P?\304<\214O5`P?I\367\375\202\035^`?\304<\214O5`P?I\367\375\202\035^`?I\367\375\202\035^`?I\367\375\202\035^`?I\367\375\202\035^`?\304<\214O5`P?I\367\375\202\035^`?I\367\375\202\035^`?\304<\214O5`P?I\367\375\202\035^`?\304<\214O5`P?I\367\375\202\035^`?\326\251L\243\t\212h?I\367\375\202\035^`?\372q\326\372\320mt?\326\251L\243\t\212h?\372q\326\372\320mt?I\367\375\202\035^`?\326\251L\243\t\212h?\326\251L\243\t\212h?\326\251L\243\t\212h?\374\367\302\014\360Yp?I\367\375\202\035^`?I\367\375\202\035^`?\326\251L\243\t\212h?\374\367\302\014\360Yp?\326\251L\243\t\212h?\374\367\302\014\360Yp?\372q\326\372\320mt?\304<\214O5`P?\326\251L\243\t\212h?\326\251L\243\t\212h?\326\251L\243\t\212h?\372q\326\372\320mt?\326\251L\243\t\212h?6d^!|Y\202?I\367\375\202\035^`?I\367\375\202\035^`?I\367\375\202\035^`?I\367\375\202\035^`?I\367\375\202\035^`?I\367\375\202\035^`?\326\251L\243\t\212h?I\367\375\202\035^`?I\367\375\202\035^`?\374\367\302\014\360Yp?\326\251L\243\t\212h?\326\251L\243\t\212h?\326\251L\243\t\212h?\304<\214O5`P?\304<\214O5`P?\326\251L\243\t\212h?\326\251L\243\t\212h?"
      }
    }
  }
}
node {
  name: "tensors/component_9"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 73
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 73
          }
        }
        tensor_content: "\3579\372\376B.\346?\"\232\232\307\367\217\314?qH\241\241\021\225\315?qH\241\241\021\225\315?qH\241\241\021\225\315?\334\271\341{\223\312\320?\177:\250\267p\177\312?\334\271\341{\223\312\320?\334\271\341{\223\312\320?\177:\250\267p\177\312?\246\'\220\032\032D\306?\177:\250\267p\177\312?\3174\327\346\037H\321?z\263\263l\034\231\317?\250\306\213\347\361s\311?\007S>\347\262\030\304?\007S>\347\262\030\304?\"\232\232\307\367\217\314?\263\016\007>m\377\302?\"\232\232\307\367\217\314?qH\241\241\021\225\315?\"\232\232\307\367\217\314?qH\241\241\021\225\315?\246\'\220\032\032D\306?\246\'\220\032\032D\306?\"\232\232\307\367\217\314?\250\306\213\347\361s\311?\306F<y?f\310?\207\221\213\237\247I\277?\306F<y?f\310?u\226\344\021PV\307?4\001e\030\331\226\347?\205\303\023\3572\005\346?@3P\004\024H\347?\3579\372\376B.\346?\2430\030Lh \347?\177\004\362\255:\250\346?nf\351b\363\275\347?/\317\215\035|\320\346?Up\004\313\216o\347?\336\275\322\300\231\013\350?\260\023\326\270&2\350?@3P\004\024H\347?nf\351b\363\275\347?\3579\372\376B.\346?\2430\030Lh \347?Up\004\313\216o\347?\2430\030Lh \347?\\uvfs\262\345?@3P\004\024H\347?\177\004\362\255:\250\346?\3579\372\376B.\346?\2430\030Lh \347?Up\004\313\216o\347?\311b-Z\306\177\346?nf\351b\363\275\347?nf\351b\363\275\347?4\001e\030\331\226\347?\177\004\362\255:\250\346?4\001e\030\331\226\347?\323\346\357\240\036W\346?nf\351b\363\275\347?\311b-Z\306\177\346?nf\351b\363\275\347?\336\275\322\300\231\013\350?v\270\002\362\333%\324?\361\"k(\213\370\346?\361\"k(\213\370\346?\311b-Z\306\177\346?\377!\204j\266~\350?\377!\204j\266~\350?[\033\006\340\016L\320?[\033\006\340\016L\320?"
      }
    }
  }
}
node {
  name: "tensors/component_10"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 73
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 73
          }
        }
        tensor_content: "\3579\372\376B.\346?\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000z\263\263l\034\231\317?z\263\263l\034\231\317?z\263\263l\034\231\317?[\033\006\340\016L\320?z\263\263l\034\231\317?[\033\006\340\016L\320?\223%[\025\033\230\316?z\263\263l\034\231\317?z\263\263l\034\231\317?\3174\327\346\037H\321?z\263\263l\034\231\317?\3174\327\346\037H\321?\3174\327\346\037H\321?[\033\006\340\016L\320?z\263\263l\034\231\317?z\263\263l\034\231\317?z\263\263l\034\231\317?\334\271\341{\223\312\320?\223%[\025\033\230\316?z\263\263l\034\231\317?z\263\263l\034\231\317?[\033\006\340\016L\320?\334\271\341{\223\312\320?[\033\006\340\016L\320?\334\271\341{\223\312\320?\3174\327\346\037H\321?\3174\327\346\037H\321?[\033\006\340\016L\320?z\263\263l\034\231\317?z\263\263l\034\231\317?[\033\006\340\016L\320?\223%[\025\033\230\316?[\033\006\340\016L\320?[\033\006\340\016L\320?\000\000\000\000\000\000\000\000\013\216\215\336`3\344?\013\216\215\336`3\344?\013\216\215\336`3\344?\2174\023\331\302\210\345?\2174\023\331\302\210\345?\263\016\007>m\377\302?\263\016\007>m\377\302?"
      }
    }
  }
}
node {
  name: "tensors/component_11"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 73
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 73
          }
        }
        tensor_content: "\000\000\000\000\000\000\360\277VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277TUUUUU\325?VUUUUU\325\277TUUUUU\325?VUUUUU\325\277VUUUUU\325\277TUUUUU\325?TUUUUU\325?TUUUUU\325?TUUUUU\325?VUUUUU\325\277TUUUUU\325?VUUUUU\325\277VUUUUU\325\277TUUUUU\325?TUUUUU\325?TUUUUU\325?VUUUUU\325\277TUUUUU\325?TUUUUU\325?TUUUUU\325?TUUUUU\325?VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277TUUUUU\325?TUUUUU\325?TUUUUU\325?TUUUUU\325?VUUUUU\325\277TUUUUU\325?VUUUUU\325\277VUUUUU\325\277TUUUUU\325?TUUUUU\325?TUUUUU\325?TUUUUU\325?VUUUUU\325\277TUUUUU\325?VUUUUU\325\277TUUUUU\325?VUUUUU\325\277TUUUUU\325?VUUUUU\325\277VUUUUU\325\277TUUUUU\325?VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277\000\000\000\000\000\000\360?\000\000\000\000\000\000\360?\000\000\000\000\000\000\360?\000\000\000\000\000\000\360?\000\000\000\000\000\000\360?\000\000\000\000\000\000\360?\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277"
      }
    }
  }
}
node {
  name: "tensors/component_12"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 73
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 73
          }
        }
        tensor_content: "\000\000\000\000\000\000\360\277\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360?\000\000\000\000\000\000\360?"
      }
    }
  }
}
node {
  name: "tensors/component_13"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 73
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 73
          }
        }
        tensor_content: "\000\000\000\000\000\000\360\277VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277VUUUUU\325\277TUUUUU\325?TUUUUU\325?TUUUUU\325?TUUUUU\325?TUUUUU\325?TUUUUU\325?TUUUUU\325?TUUUUU\325?TUUUUU\325?TUUUUU\325?TUUUUU\325?TUUUUU\325?TUUUUU\325?TUUUUU\325?TUUUUU\325?TUUUUU\325?TUUUUU\325?TUUUUU\325?TUUUUU\325?TUUUUU\325?TUUUUU\325?TUUUUU\325?TUUUUU\325?TUUUUU\325?TUUUUU\325?TUUUUU\325?TUUUUU\325?TUUUUU\325?TUUUUU\325?TUUUUU\325?TUUUUU\325?TUUUUU\325?TUUUUU\325?TUUUUU\325?\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360?\000\000\000\000\000\000\360?"
      }
    }
  }
}
node {
  name: "tensors/component_14"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 73
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 73
          }
        }
        tensor_content: "\000\000\000\000\000\000\360\277\000\000\000\000\000\000\340\277\000\000\000\000\000\000\340\277\000\000\000\000\000\000\340\277\000\000\000\000\000\000\340\277\000\000\000\000\000\000\340\277\000\000\000\000\000\000\340\277\000\000\000\000\000\000\340\277\000\000\000\000\000\000\340\277\000\000\000\000\000\000\340\277\000\000\000\000\000\000\340\277\000\000\000\000\000\000\340\277\000\000\000\000\000\000\340\277\000\000\000\000\000\000\340\277\000\000\000\000\000\000\340\277\000\000\000\000\000\000\340\277\000\000\000\000\000\000\340\277\000\000\000\000\000\000\340\277\000\000\000\000\000\000\340\277\000\000\000\000\000\000\340\277\000\000\000\000\000\000\340\277\000\000\000\000\000\000\340\277\000\000\000\000\000\000\340\277\000\000\000\000\000\000\340\277\000\000\000\000\000\000\340\277\000\000\000\000\000\000\340\277\000\000\000\000\000\000\340\277\000\000\000\000\000\000\340\277\000\000\000\000\000\000\340\277\000\000\000\000\000\000\340\277\000\000\000\000\000\000\340\277\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\340?\000\000\000\000\000\000\340?\000\000\000\000\000\000\340?\000\000\000\000\000\000\340?\000\000\000\000\000\000\340?\000\000\000\000\000\000\340?\000\000\000\000\000\000\360?\000\000\000\000\000\000\360?"
      }
    }
  }
}
node {
  name: "tensors/component_15"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 73
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 73
          }
        }
        tensor_content: "\000\000\000\000\000\000\360\277\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277\000\000\000\000\000\000\360\277"
      }
    }
  }
}
node {
  name: "tensors/component_16"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 73
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 73
          }
        }
        tensor_content: "\000\000\000\000\000\300\227@\000\000\000\000\000`\223@\000\000\000\000\000`\223@\000\000\000\000\000`\223@\000\000\000\000\000`\223@\000\000\000\000\000`\223@\000\000\000\000\000`\223@\000\000\000\000\000`\223@\000\000\000\000\000`\223@\000\000\000\000\000`\223@\000\000\000\000\000\020\223@\000\000\000\000\000`\223@\000\000\000\000\000h\216@\000\000\000\000\000`\223@\000\000\000\000\000`\223@\000\000\000\000\000\020\223@\000\000\000\000\000\020\223@\000\000\000\000\0008\223@\000\000\000\000\000\020\223@\000\000\000\000\000`\223@\000\000\000\000\000\020\223@\000\000\000\000\000`\223@\000\000\000\000\000`\223@\000\000\000\000\0008\223@\000\000\000\000\000h\216@\000\000\000\000\0008\223@\000\000\000\000\000`\223@\000\000\000\000\0008\223@\000\000\000\000\000\020\223@\000\000\000\000\0008\223@\000\000\000\000\000\250\221@\000\000\000\000\000(\232@\000\000\000\000\000(\232@\000\000\000\000\000(\232@\000\000\000\000\000(\232@\000\000\000\000\000(\232@\000\000\000\000\000(\232@\000\000\000\000\000(\232@\000\000\000\000\000(\232@\000\000\000\000\000(\232@\000\000\000\000\000(\231@\000\000\000\000\000(\231@\000\000\000\000\000(\231@\000\000\000\000\000(\231@\000\000\000\000\000(\232@\000\000\000\000\000(\231@\000\000\000\000\000(\232@\000\000\000\000\000(\232@\000\000\000\000\000(\231@\000\000\000\000\000(\231@\000\000\000\000\000(\231@\000\000\000\000\000(\231@\000\000\000\000\000(\232@\000\000\000\000\000(\231@\000\000\000\000\000(\232@\000\000\000\000\000(\231@\000\000\000\000\000(\232@\000\000\000\000\000(\231@\000\000\000\000\000(\232@\000\000\000\000\000(\232@\000\000\000\000\000(\231@\000\000\000\000\000(\232@\000\000\000\000\000(\232@\000\000\000\000\000(\232@\000\000\000\000\000(\232@\000\000\000\000\000\210\230@\000\000\000\000\000\334\226@\000\000\000\000\000\310\226@\000\000\000\000\000\334\226@\000\000\000\000\000\340\226@\000\000\000\000\000\324\226@\000\000\000\000\000\324\220@\000\000\000\000\0004\220@"
      }
    }
  }
}
node {
  name: "batch_size"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 8
      }
    }
  }
}
node {
  name: "drop_remainder"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_BOOL
        tensor_shape {
        }
        bool_val: false
      }
    }
  }
}
node {
  name: "count"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: -1
      }
    }
  }
}
node {
  name: "buffer_size"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 100
      }
    }
  }
}
node {
  name: "seed"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "seed2"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "OneShotIterator"
  op: "OneShotIterator"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dataset_factory"
    value {
      func {
        name: "_make_dataset_nfaJa1DGQC8"
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "IteratorToStringHandle"
  op: "IteratorToStringHandle"
  input: "OneShotIterator"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "IteratorGetNext"
  op: "IteratorGetNext"
  input: "OneShotIterator"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
